kfk-mobile_dev/src/Documents/ОФ_УборкаУрожая/ОФ_УборкаУрожая.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОФ_УборкаУрожая</name>
  <posting>Deny</posting>
  <attributes>
    <name>Поле</name>
    <type>
      <types>CatalogRef.АпкПоля</types>
    </type>
  </attributes>
  <attributes>
    <name>Помология</name>
    <type>
      <types>CatalogRef.АпкПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияСортовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоКонтейнеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоСортовых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоНеСортовых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Контейнеры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодОтсканирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродукцияСортовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

kfk-mobile_dev/src/Documents/ОФ_УборкаУрожая/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	
	Контейнеры.Очистить();
	Автор = Константы.ПользовательЦентральнойБазы.Получить();
	ИтогоКонтейнеров = 0;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Константы.ПользовательЦентральнойБазы.Получить();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИтогоКонтейнеров = Контейнеры.Количество();
	
КонецПроцедуры
